import imageService from "./imageService";

const infoCards = [
  {
    _id: "363200b8-5188-43a5-88f6-917405251914",
    domain: "Моделирование БП",
    title: "Методология",
    imgSrc: imageService.framework,
    textItems: [
      "Бизнес-процесс Проверка регламентов бизнес-процессов,\n" +
        "публикуемых в портале корпоративной документации.pdf",
      "Бизнес-процесс Создание, изменение регламентов бизнес-процессов\n" +
        "компании.pdf",
      "Инструкция по созданию ключевых показателей эффективности\n" +
        "бизнес-процессов верхнего уровня.pdf",
      "Памятка по ключевым элементам моделирования бизнес-процессов\n" +
        "BPMN 2.0.pptx",
      "Стандарт моделирования.pdf",
    ],
  },
  {
    _id: "2df0fa5f-007a-4fcc-89bc-beb75386ef57",
    domain: "Моделирование БП",
    title: "Business Studio",
    imgSrc: imageService.money,
    textItems: [
      "Установка и первоначальная настройка Business Studio",
      "Сопровождение Business Studio",
      "Как аналитику БП получить доступ в Business Studio?",
    ],
  },
  {
    _id: "2d4aad9d-55bf-4c94-858d-b341cb4a71cb",
    domain: "Моделирование БП",
    title: "Каталог процессов",
    imgSrc: imageService.process,
    textItems: [
      "Каталог бизнес-процессов ПАО Магнит по состоянию на 25.12.2019.xls",
    ],
  },
  {
    _id: "dfb01d89-91bf-47da-9121-e55be9277d2b",
    domain: "Оптимизация БП",
    title: "Инструменты потимизации БП",
    imgSrc: imageService.optimization,
    textItems: [
      "Бизнес-процесс по оптимизации БП",
      "Путеводитель по оптимизации процессов",
      "Шаблон по оптимизации процессов",
      "Ссылка на материалы по формированию бизнес-требования",
      "Шаблон бизнес-требования",
      "Методика расчета экономического эффекта",
    ],
  },
  {
    _id: "c4f253c2-97b2-4fb9-991d-bcf427a53328",
    domain: "Оптимизация БП",
    title: "Мониторинг работ оптимизации БП",
    imgSrc: imageService.cms,
    textItems: [
      "Планы работ по оптимизации процессов",
      "Рейтинг работ по потимизации процессов внутри компании",
      "Презентации по потимизации БП для коммуникаций",
    ],
  },
  {
    _id: "818c37b1-fe1c-4cf8-b2b0-8e3e07a6acd1",
    domain: "Оптимизация БП",
    title: "Портфель проектов по оптимизации БП",
    imgSrc: imageService.dashboard,
    textItems: ["План проектов по оптимизации БП"],
  },
  {
    _id: "9c5a13e9-864a-4fca-92e9-6e763ed5b122",
    domain: "Оценка зрелости БП",
    title: "Методология",
    imgSrc: imageService.framework,
    textItems: [
      "Бизнес-процесс по оценке зрелости БП",
      "Критерии по оценке зрелости БП",
      "Анкета для владельцев процесса",
      "Анкета для сотрудников БП",
    ],
  },
  {
    _id: "a97f50fd-0fda-4b80-a37b-086907dc140a",
    domain: "Оценка зрелости БП",
    title: "Портфель работ по оценке зрелости",
    imgSrc: imageService.test,
    textItems: [
      "Планы работ по оценке зрелости БП",
      "Календарь аудитов по оценке зрелости БП",
      "Презентации по оценке зрелости для коммуникаций",
      "Мониторинг по планам работ по оценке зрелости",
    ],
  },
  {
    _id: "89dc17d6-11c5-4fd7-8f53-012d6b4c4ec8",
    domain: "Обучение",
    title: "Полезно почитать",
    imgSrc: imageService.book,
    textItems: ["Книги", "Статьи", "Ссылки на полезные материалы"],
  },
  {
    _id: "91072768-fcf4-4aec-ac0f-48fa52cc29d1",
    domain: "Обучение",
    title: "Программа обучения",
    imgSrc: imageService.course,
    textItems: ["Перечень направлений обучения", "Как записаться на обучение?"],
  },
  {
    _id: "e89575b6-0896-4ba1-ac48-e157727b4355",
    domain: "Обучение",
    title: "Статистика по обучению",
    imgSrc: imageService.dashboard,
    textItems: ["Статистика по обучению"],
  },
  {
    _id: "ba6be953-bb5e-4097-9942-1915b3bda828",
    domain: "События и достижения",
    title: "Новости",
    imgSrc: imageService.news,
    textItems: [
      "Раздел находится в разработке",
      "Раздел находится в разработке",
      "Раздел находится в разработке",
    ],
  },
  {
    _id: "ef746c90-b8cd-4909-bf92-e5dd8dee7951",
    domain: "События и достижения",
    title: "Конкурсы",
    imgSrc: imageService.bizfin,
    textItems: [
      "Раздел находится в разработке",
      "Раздел находится в разработке",
      "Раздел находится в разработке",
    ],
  },
  {
    _id: "46a24b4f-a71e-48d9-ab29-d20ca8493752",
    domain: "События и достижения",
    title: "Аллея славы",
    imgSrc: imageService.podium,
    textItems: [
      "Раздел находится в разработке",
      "Раздел находится в разработке",
      "Раздел находится в разработке",
    ],
  },
  {
    _id: "af3545c6-9b5c-4eb7-ac0c-9c3cfe3c4a3c",
    domain: "О нас",
    title: "Структура УОБП",
    imgSrc: imageService.diagram,
    textItems: [
      "Команда управления",
      "Основные цели и задачи управления",
      "Контакты",
    ],
  },
  {
    _id: "5d298688-24b0-4df8-935c-ffc1a90b3a90",
    domain: "О нас",
    title: "Аналитик БП",
    imgSrc: imageService.analytics,
    textItems: ["Профили аналитика БП", "Реестр аналитиков БП"],
  },
];

export function getInfoCards() {
  return infoCards;
}
